Duet3D/Duet3Expansion/src/atmel/SAM4S_DFP/1.0.56/sam4s/atdf/ATSAM4S4C.atdf
        <register caption="SMC MODE Register (CS_number = 0)" name="SMC_MODE0" offset="0xC" rw="RW" size="4">
          <bitfield caption="Read Mode" mask="0x00000001" name="READ_MODE"/>
          <bitfield caption="Write Mode" mask="0x00000002" name="WRITE_MODE"/>
          <bitfield caption="NWAIT Mode" mask="0x00000030" name="EXNW_MODE" values="SMC_MODE0__EXNW_MODE"/>
          <bitfield caption="Data Float Time" mask="0x000F0000" name="TDF_CYCLES"/>
          <bitfield caption="TDF Optimization" mask="0x00100000" name="TDF_MODE"/>
          <bitfield caption="Page Mode Enabled" mask="0x01000000" name="PMEN"/>
          <bitfield caption="Page Size" mask="0x30000000" name="PS" values="SMC_MODE0__PS"/>
        </register>
        <register caption="SMC Setup Register (CS_number = 1)" name="SMC_SETUP1" offset="0x10" rw="RW" size="4">
          <bitfield caption="NWE Setup Length" mask="0x0000003F" name="NWE_SETUP"/>
          <bitfield caption="NCS Setup Length in WRITE Access" mask="0x00003F00" name="NCS_WR_SETUP"/>
          <bitfield caption="NRD Setup Length" mask="0x003F0000" name="NRD_SETUP"/>
          <bitfield caption="NCS Setup Length in READ Access" mask="0x3F000000" name="NCS_RD_SETUP"/>
        </register>
        <register caption="SMC Pulse Register (CS_number = 1)" name="SMC_PULSE1" offset="0x14" rw="RW" size="4">
          <bitfield caption="NWE Pulse Length" mask="0x0000007F" name="NWE_PULSE"/>
          <bitfield caption="NCS Pulse Length in WRITE Access" mask="0x00007F00" name="NCS_WR_PULSE"/>
          <bitfield caption="NRD Pulse Length" mask="0x007F0000" name="NRD_PULSE"/>
          <bitfield caption="NCS Pulse Length in READ Access" mask="0x7F000000" name="NCS_RD_PULSE"/>
        </register>
        <register caption="SMC Cycle Register (CS_number = 1)" name="SMC_CYCLE1" offset="0x18" rw="RW" size="4">
          <bitfield caption="Total Write Cycle Length" mask="0x000001FF" name="NWE_CYCLE"/>
          <bitfield caption="Total Read Cycle Length" mask="0x01FF0000" name="NRD_CYCLE"/>
        </register>
        <register caption="SMC MODE Register (CS_number = 1)" name="SMC_MODE1" offset="0x1C" rw="RW" size="4">
          <bitfield caption="Read Mode" mask="0x00000001" name="READ_MODE"/>
          <bitfield caption="Write Mode" mask="0x00000002" name="WRITE_MODE"/>
          <bitfield caption="NWAIT Mode" mask="0x00000030" name="EXNW_MODE" values="SMC_MODE1__EXNW_MODE"/>
          <bitfield caption="Data Float Time" mask="0x000F0000" name="TDF_CYCLES"/>
          <bitfield caption="TDF Optimization" mask="0x00100000" name="TDF_MODE"/>
          <bitfield caption="Page Mode Enabled" mask="0x01000000" name="PMEN"/>
          <bitfield caption="Page Size" mask="0x30000000" name="PS" values="SMC_MODE1__PS"/>
        </register>
        <register caption="SMC Setup Register (CS_number = 2)" name="SMC_SETUP2" offset="0x20" rw="RW" size="4">
          <bitfield caption="NWE Setup Length" mask="0x0000003F" name="NWE_SETUP"/>
          <bitfield caption="NCS Setup Length in WRITE Access" mask="0x00003F00" name="NCS_WR_SETUP"/>
          <bitfield caption="NRD Setup Length" mask="0x003F0000" name="NRD_SETUP"/>
          <bitfield caption="NCS Setup Length in READ Access" mask="0x3F000000" name="NCS_RD_SETUP"/>
        </register>
        <register caption="SMC Pulse Register (CS_number = 2)" name="SMC_PULSE2" offset="0x24" rw="RW" size="4">
          <bitfield caption="NWE Pulse Length" mask="0x0000007F" name="NWE_PULSE"/>
          <bitfield caption="NCS Pulse Length in WRITE Access" mask="0x00007F00" name="NCS_WR_PULSE"/>
          <bitfield caption="NRD Pulse Length" mask="0x007F0000" name="NRD_PULSE"/>
          <bitfield caption="NCS Pulse Length in READ Access" mask="0x7F000000" name="NCS_RD_PULSE"/>
        </register>
        <register caption="SMC Cycle Register (CS_number = 2)" name="SMC_CYCLE2" offset="0x28" rw="RW" size="4">
          <bitfield caption="Total Write Cycle Length" mask="0x000001FF" name="NWE_CYCLE"/>
          <bitfield caption="Total Read Cycle Length" mask="0x01FF0000" name="NRD_CYCLE"/>
        </register>
        <register caption="SMC MODE Register (CS_number = 2)" name="SMC_MODE2" offset="0x2C" rw="RW" size="4">
          <bitfield caption="Read Mode" mask="0x00000001" name="READ_MODE"/>
          <bitfield caption="Write Mode" mask="0x00000002" name="WRITE_MODE"/>
          <bitfield caption="NWAIT Mode" mask="0x00000030" name="EXNW_MODE" values="SMC_MODE2__EXNW_MODE"/>
          <bitfield caption="Data Float Time" mask="0x000F0000" name="TDF_CYCLES"/>
          <bitfield caption="TDF Optimization" mask="0x00100000" name="TDF_MODE"/>
          <bitfield caption="Page Mode Enabled" mask="0x01000000" name="PMEN"/>
          <bitfield caption="Page Size" mask="0x30000000" name="PS" values="SMC_MODE2__PS"/>
        </register>
        <register caption="SMC Setup Register (CS_number = 3)" name="SMC_SETUP3" offset="0x30" rw="RW" size="4">
          <bitfield caption="NWE Setup Length" mask="0x0000003F" name="NWE_SETUP"/>
          <bitfield caption="NCS Setup Length in WRITE Access" mask="0x00003F00" name="NCS_WR_SETUP"/>
          <bitfield caption="NRD Setup Length" mask="0x003F0000" name="NRD_SETUP"/>
          <bitfield caption="NCS Setup Length in READ Access" mask="0x3F000000" name="NCS_RD_SETUP"/>
        </register>
        <register caption="SMC Pulse Register (CS_number = 3)" name="SMC_PULSE3" offset="0x34" rw="RW" size="4">
          <bitfield caption="NWE Pulse Length" mask="0x0000007F" name="NWE_PULSE"/>
          <bitfield caption="NCS Pulse Length in WRITE Access" mask="0x00007F00" name="NCS_WR_PULSE"/>
          <bitfield caption="NRD Pulse Length" mask="0x007F0000" name="NRD_PULSE"/>
          <bitfield caption="NCS Pulse Length in READ Access" mask="0x7F000000" name="NCS_RD_PULSE"/>
        </register>
        <register caption="SMC Cycle Register (CS_number = 3)" name="SMC_CYCLE3" offset="0x38" rw="RW" size="4">
          <bitfield caption="Total Write Cycle Length" mask="0x000001FF" name="NWE_CYCLE"/>
          <bitfield caption="Total Read Cycle Length" mask="0x01FF0000" name="NRD_CYCLE"/>
        </register>
        <register caption="SMC MODE Register (CS_number = 3)" name="SMC_MODE3" offset="0x3C" rw="RW" size="4">
          <bitfield caption="Read Mode" mask="0x00000001" name="READ_MODE"/>
          <bitfield caption="Write Mode" mask="0x00000002" name="WRITE_MODE"/>
          <bitfield caption="NWAIT Mode" mask="0x00000030" name="EXNW_MODE" values="SMC_MODE3__EXNW_MODE"/>
          <bitfield caption="Data Float Time" mask="0x000F0000" name="TDF_CYCLES"/>
          <bitfield caption="TDF Optimization" mask="0x00100000" name="TDF_MODE"/>
          <bitfield caption="Page Mode Enabled" mask="0x01000000" name="PMEN"/>
          <bitfield caption="Page Size" mask="0x30000000" name="PS" values="SMC_MODE3__PS"/>
        </register>
        <register caption="SMC OCMS MODE Register" name="SMC_OCMS" offset="0x80" rw="RW" size="4">
          <bitfield caption="Static Memory Controller Scrambling Enable" mask="0x00000001" name="SMSE"/>
          <bitfield caption="Chip Select (x = 0 to 3) Scrambling Enable" mask="0x00010000" name="CS0SE"/>
          <bitfield caption="Chip Select (x = 0 to 3) Scrambling Enable" mask="0x00020000" name="CS1SE"/>
          <bitfield caption="Chip Select (x = 0 to 3) Scrambling Enable" mask="0x00040000" name="CS2SE"/>
          <bitfield caption="Chip Select (x = 0 to 3) Scrambling Enable" mask="0x00080000" name="CS3SE"/>
        </register>
        <register caption="SMC OCMS KEY1 Register" name="SMC_KEY1" offset="0x84" rw="W" size="4">
          <bitfield caption="Off Chip Memory Scrambling (OCMS) Key Part 1" mask="0xFFFFFFFF" name="KEY1"/>
        </register>
        <register caption="SMC OCMS KEY2 Register" name="SMC_KEY2" offset="0x88" rw="W" size="4">
          <bitfield caption="Off Chip Memory Scrambling (OCMS) Key Part 2" mask="0xFFFFFFFF" name="KEY2"/>
        </register>
        <register caption="SMC Write Protection Mode Register" name="SMC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protect Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="SMC_WPMR__WPKEY"/>
        </register>
        <register caption="SMC Write Protection Status Register" name="SMC_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="" name="SMC_MODE0__EXNW_MODE">
        <value caption="Disabled" name="DISABLED" value="0x0"/>
        <value caption="Frozen Mode" name="FROZEN" value="0x2"/>
        <value caption="Ready Mode" name="READY" value="0x3"/>
      </value-group>
      <value-group caption="" name="SMC_MODE0__PS">
        <value caption="4-byte page" name="_4_BYTE" value="0x0"/>
        <value caption="8-byte page" name="_8_BYTE" value="0x1"/>
        <value caption="16-byte page" name="_16_BYTE" value="0x2"/>
        <value caption="32-byte page" name="_32_BYTE" value="0x3"/>
      </value-group>
      <value-group caption="" name="SMC_MODE1__EXNW_MODE">
        <value caption="Disabled" name="DISABLED" value="0x0"/>
        <value caption="Frozen Mode" name="FROZEN" value="0x2"/>
        <value caption="Ready Mode" name="READY" value="0x3"/>
      </value-group>
      <value-group caption="" name="SMC_MODE1__PS">
        <value caption="4-byte page" name="_4_BYTE" value="0x0"/>
        <value caption="8-byte page" name="_8_BYTE" value="0x1"/>
        <value caption="16-byte page" name="_16_BYTE" value="0x2"/>
        <value caption="32-byte page" name="_32_BYTE" value="0x3"/>
      </value-group>
