Duet3D/Duet3Expansion/src/atmel/SAM4S_DFP/1.0.56/sam4s/atdf/ATSAM4S4C.atdf
        <register caption="Receive Compare 0 Register" name="SSC_RC0R" offset="0x38" rw="RW" size="4">
          <bitfield caption="Receive Compare Data 0" mask="0x0000FFFF" name="CP0"/>
        </register>
        <register caption="Receive Compare 1 Register" name="SSC_RC1R" offset="0x3C" rw="RW" size="4">
          <bitfield caption="Receive Compare Data 1" mask="0x0000FFFF" name="CP1"/>
        </register>
        <register caption="Status Register" name="SSC_SR" offset="0x40" rw="R" size="4">
          <bitfield caption="Transmit Ready" mask="0x00000001" name="TXRDY"/>
          <bitfield caption="Transmit Empty" mask="0x00000002" name="TXEMPTY"/>
          <bitfield caption="End of Transmission" mask="0x00000004" name="ENDTX"/>
          <bitfield caption="Transmit Buffer Empty" mask="0x00000008" name="TXBUFE"/>
          <bitfield caption="Receive Ready" mask="0x00000010" name="RXRDY"/>
          <bitfield caption="Receive Overrun" mask="0x00000020" name="OVRUN"/>
          <bitfield caption="End of Reception" mask="0x00000040" name="ENDRX"/>
          <bitfield caption="Receive Buffer Full" mask="0x00000080" name="RXBUFF"/>
          <bitfield caption="Compare 0" mask="0x00000100" name="CP0"/>
          <bitfield caption="Compare 1" mask="0x00000200" name="CP1"/>
          <bitfield caption="Transmit Sync" mask="0x00000400" name="TXSYN"/>
          <bitfield caption="Receive Sync" mask="0x00000800" name="RXSYN"/>
          <bitfield caption="Transmit Enable" mask="0x00010000" name="TXEN"/>
          <bitfield caption="Receive Enable" mask="0x00020000" name="RXEN"/>
        </register>
        <register caption="Interrupt Enable Register" name="SSC_IER" offset="0x44" rw="W" size="4">
          <bitfield caption="Transmit Ready Interrupt Enable" mask="0x00000001" name="TXRDY"/>
          <bitfield caption="Transmit Empty Interrupt Enable" mask="0x00000002" name="TXEMPTY"/>
          <bitfield caption="End of Transmission Interrupt Enable" mask="0x00000004" name="ENDTX"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Enable" mask="0x00000008" name="TXBUFE"/>
          <bitfield caption="Receive Ready Interrupt Enable" mask="0x00000010" name="RXRDY"/>
          <bitfield caption="Receive Overrun Interrupt Enable" mask="0x00000020" name="OVRUN"/>
          <bitfield caption="End of Reception Interrupt Enable" mask="0x00000040" name="ENDRX"/>
          <bitfield caption="Receive Buffer Full Interrupt Enable" mask="0x00000080" name="RXBUFF"/>
          <bitfield caption="Compare 0 Interrupt Enable" mask="0x00000100" name="CP0"/>
          <bitfield caption="Compare 1 Interrupt Enable" mask="0x00000200" name="CP1"/>
          <bitfield caption="Tx Sync Interrupt Enable" mask="0x00000400" name="TXSYN"/>
          <bitfield caption="Rx Sync Interrupt Enable" mask="0x00000800" name="RXSYN"/>
        </register>
        <register caption="Interrupt Disable Register" name="SSC_IDR" offset="0x48" rw="W" size="4">
          <bitfield caption="Transmit Ready Interrupt Disable" mask="0x00000001" name="TXRDY"/>
          <bitfield caption="Transmit Empty Interrupt Disable" mask="0x00000002" name="TXEMPTY"/>
          <bitfield caption="End of Transmission Interrupt Disable" mask="0x00000004" name="ENDTX"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Disable" mask="0x00000008" name="TXBUFE"/>
          <bitfield caption="Receive Ready Interrupt Disable" mask="0x00000010" name="RXRDY"/>
          <bitfield caption="Receive Overrun Interrupt Disable" mask="0x00000020" name="OVRUN"/>
          <bitfield caption="End of Reception Interrupt Disable" mask="0x00000040" name="ENDRX"/>
          <bitfield caption="Receive Buffer Full Interrupt Disable" mask="0x00000080" name="RXBUFF"/>
          <bitfield caption="Compare 0 Interrupt Disable" mask="0x00000100" name="CP0"/>
          <bitfield caption="Compare 1 Interrupt Disable" mask="0x00000200" name="CP1"/>
          <bitfield caption="Tx Sync Interrupt Enable" mask="0x00000400" name="TXSYN"/>
          <bitfield caption="Rx Sync Interrupt Enable" mask="0x00000800" name="RXSYN"/>
        </register>
        <register caption="Interrupt Mask Register" name="SSC_IMR" offset="0x4C" rw="R" size="4">
          <bitfield caption="Transmit Ready Interrupt Mask" mask="0x00000001" name="TXRDY"/>
          <bitfield caption="Transmit Empty Interrupt Mask" mask="0x00000002" name="TXEMPTY"/>
          <bitfield caption="End of Transmission Interrupt Mask" mask="0x00000004" name="ENDTX"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Mask" mask="0x00000008" name="TXBUFE"/>
          <bitfield caption="Receive Ready Interrupt Mask" mask="0x00000010" name="RXRDY"/>
          <bitfield caption="Receive Overrun Interrupt Mask" mask="0x00000020" name="OVRUN"/>
          <bitfield caption="End of Reception Interrupt Mask" mask="0x00000040" name="ENDRX"/>
          <bitfield caption="Receive Buffer Full Interrupt Mask" mask="0x00000080" name="RXBUFF"/>
          <bitfield caption="Compare 0 Interrupt Mask" mask="0x00000100" name="CP0"/>
          <bitfield caption="Compare 1 Interrupt Mask" mask="0x00000200" name="CP1"/>
          <bitfield caption="Tx Sync Interrupt Mask" mask="0x00000400" name="TXSYN"/>
          <bitfield caption="Rx Sync Interrupt Mask" mask="0x00000800" name="RXSYN"/>
        </register>
        <register caption="Write Protection Mode Register" name="SSC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="SSC_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="SSC_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protect Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
        <register caption="Receive Pointer Register" name="SSC_RPR" offset="0x100" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="SSC_RCR" offset="0x104" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Transmit Pointer Register" name="SSC_TPR" offset="0x108" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0xFFFFFFFF" name="TXPTR"/>
        </register>
        <register caption="Transmit Counter Register" name="SSC_TCR" offset="0x10C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0x0000FFFF" name="TXCTR"/>
        </register>
