Duet3D/Duet3Expansion/src/atmel/SAM4S_DFP/1.0.56/sam4s/atdf/ATSAM4S4C.atdf
      <value-group caption="" name="SUPC_WUIR__WKUPT6">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT7">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT8">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT9">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT10">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT11">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT12">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT13">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT14">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUIR__WKUPT15">
        <value caption="A falling edge followed by a low level for a period defined by WKUPDBC on the corre-sponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level for a period defined by WKUPDBC on the cor-responding wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__WKUPS">
        <value caption="No wake-up due to the assertion of the WKUP pins has occurred since the last read of SUPC_SR." name="NO" value="0"/>
        <value caption="At least one wake-up due to the assertion of the WKUP pins has occurred since the last read of SUPC_SR." name="PRESENT" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__SMWS">
        <value caption="No wake-up due to a supply monitor detection has occurred since the last read of SUPC_SR." name="NO" value="0"/>
        <value caption="At least one wake-up due to a supply monitor detection has occurred since the last read of SUPC_SR." name="PRESENT" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__BODRSTS">
        <value caption="No core brownout rising edge event has been detected since the last read of the SUPC_SR." name="NO" value="0"/>
        <value caption="At least one brownout output rising edge event has been detected since the last read of the SUPC_SR." name="PRESENT" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__SMRSTS">
        <value caption="No supply monitor detection has generated a core reset since the last read of the SUPC_SR." name="NO" value="0"/>
        <value caption="At least one supply monitor detection has generated a core reset since the last read of the SUPC_SR." name="PRESENT" value="1"/>
      </value-group>
